Repository: korobochkin/reCAPTCHA-Lightweight-Adaptation
Catalog: plugin/languages/recaptcha-lightweight-adaptation-*.po
Languages: ru_ru

source: This keys settings are required. You can get it on <a href="https://www.google.com/recaptcha/admin">Google reCAPTCHA Admin</a> page.
ru_ru: Поля с ключами обязательны для заполнения. Вы можете получить их <a href="https://www.google.com/recaptcha/admin">на странице администратора Google reCAPTCHA</a>.

source: Secret keys
ru_ru: Ключи

source: Visual settings of the Captcha block (widget).
ru_ru: Визуальные настройки блока (виджета) капчи.

source: View
ru_ru: Внешний вид

source: Where to show Recaptcha widget (and validate).
ru_ru: Где показывать виджет Recaptcha (и проверять данные).

source: Locations
ru_ru: Места

source: Site key
ru_ru: Ключ сайта

source: Secret key
ru_ru: Секретный ключ

source: Light
ru_ru: Светлая

source: Dark
ru_ru: Темная

source: The color theme of the widget
ru_ru: Цветовая тема виджета

source: You can specify many of languages for Captcha widget. The list of available lanuage codes at <a href="https://developers.google.com/recaptcha/docs/language" target="_blank">Google Language codes</a>.
ru_ru: Виджет капчи поддерживает множество языков. Список доступных языков можно найти на странице <a href="https://developers.google.com/recaptcha/docs/language" target="_blank">Google Language codes</a>.

source: Language
ru_ru: Язык

source: The signup page (<code>wp-login.php?action=register</code>).
ru_ru: Страница регистрации (<code>wp-login.php?action=register</code>).

source: The reset password page (<code>wp-login.php?action=lostpassword</code>).
ru_ru: Страница сброса пароля (<code>wp-login.php?action=lostpassword</code>).

source: The pages which shows up the Recaptcha widget
ru_ru: Страницы, на которых будет показываться капча

source: The secret parameter is missing.
ru_ru: Секретный ключ не найден.

source: The secret parameter is invalid or malformed.
ru_ru: Секретный ключ неверный.

source: The response parameter is missing.
ru_ru: Уникальный код ответа не найден.

source: The response parameter is invalid or malformed.
ru_ru: Уникальный код ответа неверен.

source: Not all required data are presents in admin settings or passed to function for check.
ru_ru: Некоторые обязательные поля не были заполнены в настройках или не были переданы в функцию для проверки.

source: The obtained data from Google API have not valid format. Please notify the site administrator.
ru_ru: Полученный ответ от Google API имеет неверный формат. Пожалуйста, сообщите об этом администратору сайта.

source: Unknown Google API answer and (or) type of errors inside.
ru_ru: Непонятный ответ Google API или неизвестный тип ошибки.

source: <strong>ERROR</strong> Unknown result of the Recaptcha Light Adaptation plugin validation process.
ru_ru: <strong>ОШИБКА</strong> Незивестный результат проверки плагином Recaptcha Light Adaptation.

source: <strong>ERROR</strong>. Check „I’m not a robot“ checkbox.
ru_ru: <strong>ОШИБКА</strong>. Отметьте поле «Я не робот».

source: A lightweight Google reCAPTCHA adaptation. This plugin provides the ability to add reCAPTCHA on Sign Up and Reset password pages. Easy API and methods also available for your custom reCAPTCHA integration in the other places of your site.
ru_ru: Легкая адаптация сервиса reCAPTCHA от Google. Плагин позволяет добавить капчу от сервиса reCAPTCHA на страницы регистрации и сброса пароля. Легкое API и несколько методов внутри позволяют использовать reCAPTCHA в любом месте вашего сайта.

source: Kolya Korobochkin
ru_ru: Коля Коробочкин
